set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.srcs/sources_1/ip/image_RAM/image_RAM/image_RAM_in_context.xdc rfile:../../../../../UDP.srcs/sources_1/ip/image_RAM/image_RAM/image_RAM_in_context.xdc id:1 order:EARLY scoped_inst:R_Arbiter/recv_image/image_RAM} [current_design]
set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.srcs/sources_1/ip/CLKGEN/CLKGEN/CLKGEN_in_context.xdc rfile:../../../../../UDP.srcs/sources_1/ip/CLKGEN/CLKGEN/CLKGEN_in_context.xdc id:2 order:EARLY scoped_inst:clkgen} [current_design]
set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.srcs/sources_1/ip/queue/queue/queue_in_context.xdc rfile:../../../../../UDP.srcs/sources_1/ip/queue/queue/queue_in_context.xdc id:3 order:EARLY scoped_inst:T_Arbiter/TX_queue} [current_design]
set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.srcs/sources_1/ip/ETH_CLKGEN/ETH_CLKGEN/ETH_CLKGEN_in_context.xdc rfile:../../../../../UDP.srcs/sources_1/ip/ETH_CLKGEN/ETH_CLKGEN/ETH_CLKGEN_in_context.xdc id:4 order:EARLY scoped_inst:eth_clkgen} [current_design]
set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.srcs/constrs_1/NexysVideo_20181221.xdc rfile:../../../../../UDP.srcs/constrs_1/NexysVideo_20181221.xdc id:5} [current_design]
set_property SRC_FILE_INFO {cfile:/home/moikawa/proj_Mitsuhashi/NexysVideo_UdpTest/UDP.runs/synth_2/dont_touch.xdc rfile:../../../dont_touch.xdc id:6} [current_design]
set_property src_info {type:SCOPED_XDC file:1 line:1 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_PERIOD_OOC_TARGET 20 [get_pins R_Arbiter/recv_image/image_RAM/clka]
set_property src_info {type:SCOPED_XDC file:1 line:2 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_PERIOD_OOC_TARGET 20 [get_pins R_Arbiter/recv_image/image_RAM/clkb]
set_property src_info {type:SCOPED_XDC file:1 line:3 export:INPUT save:INPUT read:READ} [current_design]
set_property IS_IP_OOC_CELL true [get_cells R_Arbiter/recv_image/image_RAM]
set_property src_info {type:SCOPED_XDC file:2 line:1 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name SYSCLK [get_ports SYSCLK]
set_property src_info {type:SCOPED_XDC file:2 line:2 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clkgen/clk10 -source [get_ports SYSCLK] -edges {1 2 3} -edge_shift {0.000 45.000 90.000} [get_pins clkgen/clk10]
set_property src_info {type:SCOPED_XDC file:2 line:3 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clkgen/clk100 -source [get_ports SYSCLK] -edges {1 2 3} -edge_shift {0.000 0.000 0.000} [get_pins clkgen/clk100]
set_property src_info {type:SCOPED_XDC file:2 line:4 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clkgen/clk125 -source [get_ports SYSCLK] -edges {1 2 3} -edge_shift {0.000 -1.000 -2.000} [get_pins clkgen/clk125]
set_property src_info {type:SCOPED_XDC file:2 line:5 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clkgen/clk125_90 -source [get_ports SYSCLK] -edges {1 2 3} -edge_shift {2.000 1.000 0.000} [get_pins clkgen/clk125_90]
set_property src_info {type:SCOPED_XDC file:2 line:6 export:INPUT save:INPUT read:READ} [current_design]
set_property IO_BUFFER_TYPE NONE [get_ports SYSCLK]
set_property src_info {type:SCOPED_XDC file:2 line:7 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_BUFFER_TYPE NONE [get_ports SYSCLK]
set_property src_info {type:SCOPED_XDC file:2 line:8 export:INPUT save:INPUT read:READ} [current_design]
set_property IS_IP_OOC_CELL true [get_cells clkgen]
set_property src_info {type:SCOPED_XDC file:3 line:1 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_PERIOD_OOC_TARGET 10 [get_pins T_Arbiter/TX_queue/rd_clk]
set_property src_info {type:SCOPED_XDC file:3 line:2 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_PERIOD_OOC_TARGET 10 [get_pins T_Arbiter/TX_queue/wr_clk]
set_property src_info {type:SCOPED_XDC file:3 line:3 export:INPUT save:INPUT read:READ} [current_design]
set_property IS_IP_OOC_CELL true [get_cells T_Arbiter/TX_queue]
set_property src_info {type:SCOPED_XDC file:4 line:1 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 8.000 -name ETH_RXCK [get_ports ETH_RXCK]
set_property src_info {type:SCOPED_XDC file:4 line:2 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name eth_clkgen/rxck_0deg -source [get_ports ETH_RXCK] -edges {1 2 3} -edge_shift {0.000 0.000 0.000} [get_pins eth_clkgen/rxck_0deg]
set_property src_info {type:SCOPED_XDC file:4 line:3 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name eth_clkgen/rxck_180deg -source [get_ports ETH_RXCK] -edges {1 2 3} -edge_shift {4.000 4.000 4.000} [get_pins eth_clkgen/rxck_180deg]
set_property src_info {type:SCOPED_XDC file:4 line:4 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name eth_clkgen/rxck_270deg -source [get_ports ETH_RXCK] -edges {1 2 3} -edge_shift {6.000 6.000 6.000} [get_pins eth_clkgen/rxck_270deg]
set_property src_info {type:SCOPED_XDC file:4 line:5 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name eth_clkgen/rxck_90deg -source [get_ports ETH_RXCK] -edges {1 2 3} -edge_shift {2.000 2.000 2.000} [get_pins eth_clkgen/rxck_90deg]
set_property src_info {type:SCOPED_XDC file:4 line:6 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name eth_clkgen/rxck_n90deg -source [get_ports ETH_RXCK] -edges {1 2 3} -edge_shift {-2.000 -2.000 -2.000} [get_pins eth_clkgen/rxck_n90deg]
set_property src_info {type:SCOPED_XDC file:4 line:7 export:INPUT save:INPUT read:READ} [current_design]
set_property IO_BUFFER_TYPE NONE [get_ports ETH_RXCK]
set_property src_info {type:SCOPED_XDC file:4 line:8 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_BUFFER_TYPE NONE [get_ports ETH_RXCK]
set_property src_info {type:SCOPED_XDC file:4 line:9 export:INPUT save:INPUT read:READ} [current_design]
set_property IS_IP_OOC_CELL true [get_cells eth_clkgen]
set_property src_info {type:XDC file:5 line:8 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} -add [get_ports SYSCLK]
set_property src_info {type:XDC file:5 line:12 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 8.000 -name PHY_RXCLK -waveform {0.000 4.000} [get_ports ETH_RXCK]
set_property src_info {type:XDC file:5 line:14 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 8.000 -name PHY_TXCLK -waveform {0.000 4.000} [get_pins gmii2rgmii/ODDR_ck/Q]
set_property src_info {type:XDC file:5 line:25 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -max 0.500 [get_ports {ETH_RXD[*]}]
set_property src_info {type:XDC file:5 line:26 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -clock_fall -max -add_delay 0.500 [get_ports {ETH_RXD[*]}]
set_property src_info {type:XDC file:5 line:27 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -min -0.500 [get_ports {ETH_RXD[*]}]
set_property src_info {type:XDC file:5 line:28 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -clock_fall -min -add_delay -0.500 [get_ports {ETH_RXD[*]}]
set_property src_info {type:XDC file:5 line:30 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -max 0.500 [get_ports ETH_RXCTL]
set_property src_info {type:XDC file:5 line:31 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -clock_fall -max -add_delay 0.500 [get_ports ETH_RXCTL]
set_property src_info {type:XDC file:5 line:32 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -min -0.500 [get_ports ETH_RXCTL]
set_property src_info {type:XDC file:5 line:33 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock PHY_RXCLK -clock_fall -min -add_delay -0.500 [get_ports ETH_RXCTL]
set_property src_info {type:XDC file:5 line:43 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_cells R_Arbiter/trans_image/tx_en_reg*] -to [get_cells R_Arbiter/trans_image/tx_en_clk125_d_reg*]
set_property src_info {type:XDC file:5 line:67 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -to [get_ports {LED[*]}]
set_property src_info {type:XDC file:5 line:72 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_ports BTN_C]
set_property src_info {type:XDC file:5 line:73 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_ports CPU_RSTN]
set_property src_info {type:XDC file:5 line:85 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_ports {SW[*]}]
set_property src_info {type:XDC file:5 line:132 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -to [get_ports {PMOD_A[*]}]
set_property src_info {type:XDC file:5 line:143 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -to [get_ports {PMOD_B[*]}]
set_property src_info {type:XDC file:5 line:154 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -to [get_ports {PMOD_C[*]}]
set_property src_info {type:TCL file:{} line:-1 export:INPUT save:INPUT read:READ} [current_design]
set_property DONT_TOUCH true [get_cells R_Arbiter/recv_image/image_RAM]
set_property src_info {type:TCL file:{} line:-1 export:INPUT save:INPUT read:READ} [current_design]
set_property DONT_TOUCH true [get_cells clkgen]
set_property src_info {type:TCL file:{} line:-1 export:INPUT save:INPUT read:READ} [current_design]
set_property DONT_TOUCH true [get_cells T_Arbiter/TX_queue]
set_property src_info {type:TCL file:{} line:-1 export:INPUT save:INPUT read:READ} [current_design]
set_property DONT_TOUCH true [get_cells eth_clkgen]
